app/controllers/home_controller.rb

  def index
    @productos1 = Producto.all.first(3)
---
SELECT  "productos".* FROM "productos" ORDER BY "productos"."id" ASC LIMIT ?  [["LIMIT", 3]]