app/controllers/productos_controller.rb

SELECT "productos".* FROM "productos"
---
  def index
    @productos = Producto.all